In [2]:
from fastai.tabular.all import *
from fastai.collab import *

In [9]:
#loading the dataset
ratings = pd.read_csv('u.data', delimiter='\t', header=None,
                      usecols=(0,1,2), names=['user','movie','rating'])
ratings.head()
ratings.head()

   user  movie  rating
0   196    242       3
1   186    302       3
2    22    377       1
3   244     51       2
4   166    346       1

In [10]:
movies = pd.read_csv('u.item',  delimiter='|', encoding='latin-1',
                     usecols=(0,1), names=('movie','title'), header=None)
movies.head()

   movie              title
0      1   Toy Story (1995)
1      2   GoldenEye (1995)
2      3  Four Rooms (1995)
3      4  Get Shorty (1995)
4      5     Copycat (1995)

In [11]:
ratings = ratings.merge(movies)
ratings.head()

   user  movie  rating         title
0   196    242       3  Kolya (1996)
1    63    242       3  Kolya (1996)
2   226    242       5  Kolya (1996)
3   154    242       3  Kolya (1996)
4   306    242       5  Kolya (1996)

In [12]:
dls = CollabDataLoaders.from_df(ratings, item_name='title', bs=64)

In [13]:
dls.show_batch()

In [14]:
learn = collab_learner(dls, n_factors=50, y_range=(0, 5.5))

In [15]:
learn.fit_one_cycle(5, 5e-3, wd=0.1)